Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་ཀྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་གང་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བའི་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་ལས་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་འདི་ལྟ་བུའི་སྐྱེ་མཆེད་མངོན་པར་བསྒྲུབས་ཤིང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཕུང་པོའི་གཞི་ཅན། རྣམ་པར་རྟོག་པ་ལས་བྱུང་བ་ཡོངས་སུ་བཟུང་སྟེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “beings who erroneously actualize the impact of past actions through body, speech, and mind have materialized sense fields such as these, and through concepts they have acquired the base of the psycho-physical aggregates that constitute the ripening of past actions.

source: སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་དང་མིའི་འགྲོ་བ་མངོན་པར་བསྒྲུབ་བོ།
en: Thereby they materialize as the denizens of the hells, and the beings of the animal domain, the world of Yama, and the realms of gods and humans. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་རྒྱུན་དུ་ཞུགས་པར་བརྗོད་པ་ཅི་ལས་གྱུར།
en: Venerable Śāradvatīputra, you asked how those who have entered the stream to nirvāṇa are designated, and how those who are said to be destined for only one more rebirth, those who will no longer be reborn, those who are arhats, those who are pratyekabuddhas, {Ki.

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོང་བ་དང་དགྲ་བཅོམ་པ་ཉིད་དང་། རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་།
en: V: 39} those who are bodhisattvas, and those who are tathāgatas, arhats, completely awakened buddhas are designated.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་བརྗོད་པ་ཅི་ལས་གྱུར་ཅེས་ཟེར་བ་ནི་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་པར་མི་རྟོག་པ་ལས་རྒྱུན་དུ་ཞུགས་པར་བརྗོད་དོ། །རྣམ་པར་མི་རྟོག་པ་ལས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུར་བརྗོད་དོ།
en: Venerable Śāradvatīputra, those who have entered the stream to nirvāṇa are designated through nonconceptuality, and the fruit of having entered the stream to nirvāṇa is designated through nonconceptuality.

source: །རྣམ་པར་མི་རྟོག་པ་ལས་ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་དགྲ་བཅོམ་པ་ཉིད་དུ་བརྗོད་དོ།
en: Those who are destined for only one more rebirth, those who will no longer be reborn, and those who are arhats are designated through nonconceptuality.

source: །རྣམ་པར་མི་རྟོག་པ་ལས་རང་སངས་རྒྱས་དང་། རང་བྱང་ཆུབ་ཏུ་བརྗོད་དོ།
en: Pratyekabuddhas and individual enlightenment are designated through nonconceptuality.

source: །རྣམ་པར་མི་རྟོག་པ་ལས་སངས་རྒྱས་སུ་བརྗོད་དོ།
en: The buddhas are designated through nonconceptuality.

source: །རྣམ་པར་མི་རྟོག་པ་ལས་བྱང་ཆུབ་ཏུ་བརྗོད་དོ།
en: Enlightenment is designated through nonconceptuality. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་རྣམ་པར་རྟོག་པ་སྤངས་པར་གྱུར་ཏོ།
en: Venerable Śāradvatīputra, all those tathāgatas, arhats, completely awakened buddhas who appeared in the past were nonconceptual and had abandoned concepts.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་འོངས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་རྣམ་པར་རྟོག་པ་སྤངས་པར་འགྱུར་རོ།
en: Venerable Śāradvatīputra, those tathāgatas, arhats, completely awakened buddhas who will appear in the future will also be nonconceptual, and they will have abandoned concepts.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ད་ལྟར་བྱུང་བའི་དུས་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་རྣམ་པར་རྟོག་པ་སྤངས་པ་ཤ་སྟག་གོ །དེ་ལྟར་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Venerable Śāradvatīputra, all those lord buddhas who attain consummate buddhahood in unsurpassed, complete enlightenment at the present time in the world systems of the ten directions are also nonconceptual, and they absolutely abandon concepts.

source: རྣམ་གྲངས་དེས་ཆོས་ཐམས་ཅད་རྣམ་པར་རྟོག་པ་མེད་པའི་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའི་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་དེ་བཞིན་ཉིད་བརྩོན་པར་བྱ་སྟེ། རྣམ་པར་རྟོག་པ་མེད་པར་རིག་པར་བྱའོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how one should know, once the real nature of nonconceptuality, the real nature of the very limit of reality, and the real nature of the realm of phenomena have been evaluated, that all phenomena are nonconceptual.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ།
en: Venerable Śāradvatīputra, bodhisattva great beings should accordingly practice the nonconceptual perfection of wisdom.

source: རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས། རྣམ་པར་མི་རྟོག་པའི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: By practicing the nonconceptual perfection of wisdom, they will attain consummate buddhahood with respect to all phenomena that are nonconceptual.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཞི་བཅུ་བརྒྱད་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ལྔ་བཅུ་དྲུག་པ།
en: This completes the forty-eighth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་མ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་སྙིང་པོ་ལ་སྤྱོད་པའོ།
en: Chapter 49 Then the venerable Śāradvatīputra said to the venerable Subhūti, “Indeed, Venerable Subhūti, bodhisattva great beings who practice the perfection of wisdom practice that which is the essence.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་མ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི་སྙིང་པོ་མེད་པ་ལ་སྤྱོད་པའོ།
en: The venerable Subhūti replied to the venerable Śāradvatīputra, “Indeed, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom practice that which is essenceless.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྙིང་པོ་མེད་པའོ།
en: If you ask why, Venerable Śāradvatīputra, the perfection of wisdom is essenceless.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྙིང་པོ་མེད་པའོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are essenceless.

source: །ནང་སྟོང་པ་ཉིད་ནི་སྙིང་པོ་མེད་པའོ།
en: The emptiness of internal phenomena is essenceless. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་སྙིང་པོ་མེད་པའོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are essenceless.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་སྙིང་པོ་མེད་པའོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness are essenceless.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་སྙིང་པོ་མེད་པའོ།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are essenceless. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ནི་སྙིང་པོ་མེད་པའོ།
en: The fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are essenceless. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་སྙིང་པོ་མེད་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ནི་སྙིང་པོ་མེད་པ་ཉིད་ཀྱང་མི་དམིགས་ཤིང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན། སྙིང་པོ་དམིགས་པ་ལྟ་ག་ལ་ཡོད། དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་།
en: The goals], up to and including all-aspect omniscience, are essenceless.”

source: གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་ཤིན་དུ་མང་བ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཇི་སྐད་དུ་བསྟན་པ་འདི་ལ་སྤྱོད་པ་དང་། དོན་འདི་ལ་སྤྱོད་ཀྱང་ཡང་དག་པའི་མཐའ་གང་མངོན་དུ་བྱས་པས། ཉན་ཐོས་ཀྱི་ས་འམ།
en: Then the vast multitude of gods inhabiting the realm of desire and inhabiting the realm of form thought, “Those noble sons or noble daughters who set their minds on unsurpassed, complete enlightenment, who practice this profound perfection of wisdom, just as it has been explained, and who, despite practicing with that goal, do not actualize the very limit of reality through which they would remain on the level of the śrāvakas or the level of the pratyekabuddhas are all worthy of homage.

source: རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་འགྱུར་བའི་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་པ་དེ་དག་ནི་ཕྱག་བྱ་བའི་གནས་ཏེ། རྣམ་གྲངས་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་མཉམ་པ་ཉིད་འདི་མངོན་པར་མི་བྱེད་པ་དེ་དག་ནི་ཕྱག་བྱ་བར་འོས་པའོ།
en: For this reason, too, bodhisattva great beings who do not actualize the sameness of all phenomena are worthy of homage.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Subhūti said to those gods, {Ki.

source: །ལྷའི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་ནི་ཆོས་ཀྱི་མཉམ་པ་ཉིད་གང་མངོན་དུ་བྱས་པས། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་འགྱུར་བ་དེ་མངོན་དུ་མི་བྱ་བ་དེ་ནི་མི་དཀའི། ལྷའི་བུ་དག་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་ཞེས་གོ་ཆ་བགོས་ལ། གང་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱ་བའི་སེམས་ཅན་དེ་དག་ཤིན་དུ་མི་དམིགས་པ་ནི་དེ་དག་ལ་དེ་བས་དཀའ་སྟེ།
en: V: 40} “Divine princes, the difficulty for those bodhisattva great beings is not that they do not actualize the sameness of all phenomena, by doing which they would remain on the level of the śrāvakas or the level of the pratyekabuddhas, but, divine princes, beyond that, the difficulty is that they don the armor that establishes inestimable, countless, and immeasurable beings in final nirvāṇa, when those beings whom they would lead to final nirvāṇa are utterly nonapprehensible. “

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་གདུལ་བར་བྱའོ་ཞེས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ཏེ། གང་སེམས་ཅན་གདུལ་བར་སེམས་པ་དེ་ནི་ནམ་མཁའ་གདུལ་བར་སེམས་པ་དང་འདྲའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Bodhisattva great beings who practice accordingly and think they should train all beings, having set out for unsurpassed, complete enlightenment, resolving to train all beings, might as well think that they should train space.

source: ནམ་མཁའ་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པར་བལྟའོ།
en: If you ask why, beings should be regarded as void because space itself is void.

source: །ནམ་མཁའ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་སེམས་ཅན་སྟོང་པ་ཉིད་དུ་བལྟའོ།
en: beings should be regarded as emptiness because space itself is emptiness.

source: །ནམ་མཁའ་སྙིང་པོ་མེད་པའི་ཕྱིར་སེམས་ཅན་སྙིང་པོ་མེད་པར་བལྟའོ།
en: beings should be regarded as essencelessness because space itself is essenceless.

source: །ནམ་མཁའ་གསོག་གི་ཕྱིར་སེམས་ཅན་གསོག་ཏུ་བལྟའོ།
en: beings should be regarded as vacuity because space itself is vacuous.

source: །ལྷའི་བུ་དག་རྣམ་གྲངས་དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སེམས་ཅན་མེད་པ་རྣམས་ཀྱི་དོན་དུ་གོ་ཆ་གྱོན་པ་དེ་དག་ནི་དཀའ་བ་བྱེད་པ་སྟེ།
en: For this reason, divine princes, it is difficult for bodhisattva great beings who don the armor [of great compassion] for the sake of beings who do not exist.

source: གང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་གོ་ཆ་གྱོན་པ་དེ་དག་ནི་ནམ་མཁའ་དང་བརྩད་པར་འདོད་པ་སྟེ།
en: Those who, for the sake of beings, don the armor [of great compassion] might as well seek to do battle with space. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གོ་ཆ་དེ་ཡང་བགོས་ལ། སེམས་ཅན་གང་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། གོ་ཆ་བགོས་པའི་སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས་སོ།
en: The armor that bodhisattva great beings don and the beings for whose sake they don the armor are both nonapprehensible.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་དབེན་པའི་ཕྱིར་གོ་ཆ་དབེན་པར་བལྟའོ།
en: If you ask why, the armor that they don for the sake of beings should be regarded as void.

source: །གལ་ཏེ་དེ་ལྟར་བསྟན་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞུམ་པར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If, when this is explained, bodhisattva great beings are not discouraged, then they do practice the perfection of wisdom.

source: གཟུགས་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ།
en: If you ask why, beings are void because physical forms are void.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ།
en: beings are void because feelings, perceptions, formative predispositions, and consciousness are void.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་།
en: beings are void because the sense fields, the sensory elements, and the links of dependent origination are void.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ།
en: beings are void because the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are void.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ།
en: beings are void because [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are void.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དབེན་པའི་ཕྱིར་སེམས་ཅན་དབེན་པའོ།
en: beings are void because [the goals], up to and including all-aspect omniscience, are void. “

source: །གཟུགས་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའོ།
en: The perfection of wisdom is void because physical forms are void.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའོ།
en: The perfection of wisdom is void because feelings, perceptions, formative predispositions, and consciousness are void.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་།
en: The perfection of wisdom is void because the sense fields, the sensory elements, and the links of dependent origination are void.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པའོ།
en: The perfection of wisdom is void because the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are void.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའོ།
en: The perfection of wisdom is void because [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are void.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའོ།
en: The perfection of wisdom is void because [the goals], up to and including all-aspect omniscience, are void. “

source: །ལྷའི་བུ་དག་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་དབེན་པར་བཤད་པ་ལ་སེམས་མི་འཇུམ་ཡོངས་སུ་ཞུམ་པར་མི་འགྱུར་ལ། དེའི་ཡིད་འཇིགས་པར་མི་འགྱུར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Divine princes, when it is taught that all phenomena are void, if bodhisattva great beings are not discouraged and not cowed, and their minds are not afraid, then those bodhisattva great beings do practice the perfection of wisdom.”

source: །རབ་འབྱོར་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཞུམ་པར་མི་འགྱུར་བ་ཡིན། གསོལ་པ།
en: Then the Blessed One asked the venerable Subhūti, “Why, Subhūti, do bodhisattva great beings not become discouraged with regard to the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་མ་མཆིས་པའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཞུམ་པར་མི་འགྱུར་རོ།
en: Blessed Lord, bodhisattva great beings do not become discouraged with regard to the perfection of wisdom because all phenomena are nonexistent.

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་དབེན་པ་དང་ཞི་བ་དང་མ་སྐྱེས་པའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཞུམ་པར་མི་འགྱུར་ཏེ།
en: Bodhisattva great beings do not become discouraged with regard to the perfection of wisdom because all phenomena are void, at peace, and nonarising.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཞུམ་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: For this reason, Blessed Lord, bodhisattva great beings do not become discouraged with regard to the perfection of wisdom.

source: བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གང་ཞུམ་པར་འགྱུར་བ་དང་།
en: If one were to ask why, Blessed Lord, it is because all phenomena are nonexistent and nonapprehensible {Ki.

source: གང་གིས་ཞུམ་པར་འགྱུར་བ་དང་།
en: V: 41} in terms of the subject who would be discouraged, the instrument that would bring about discouragement, and the object of discouragement. “

source: གང་ལ་ཞུམ་པར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་མ་མཆིས་པ་སྟེ་དམིགས་སུ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྐད་དུ་བཤད་པ་ལ་མི་འཇུམ་མི་འགོང་ཞིང་ཚི་ཆད་པ་དང་། སྒྱིད་ལུག་པར་མི་འགྱུར་ལ། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས་སོ།
en: Blessed Lord, if, when this is explained, bodhisattva great beings are not discouraged, not fearful, not exasperated, not indolent, not afraid, and will not be terrified, then they are practicing the perfection of wisdom.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གང་ཞུམ་པར་འགྱུར་བ་འམ། གང་གིས་ཞུམ་པར་འགྱུར་བ་འམ། གང་ལ་ཞུམ་པར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་མ་མཆིས་པ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because all those are nonexistent in terms of the subject who would be discouraged, the instrument that would bring about discouragement, and the object of discouragement.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དབང་པོ་དང་བཅས་ཚངས་པ་དང་བཅས། སྐྱེ་དགུའི་བདག་པོ་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་ཕྱག་བྱ་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི། དབང་པོ་དང་བཅས། ཚངས་པ་དང་བཅས།
en: Blessed Lord, the gods headed by Indra, those headed by Brahmā, and those headed by Prajāpati will pay homage to bodhisattva great beings who practice accordingly.”

source: སྐྱེ་དགུའི་བདག་པོ་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་ཕྱག་བྱ་བར་ཡང་མ་ཟད་དེ། གང་འཕགས་པ་མངོན་པར་འཕགས་པའི་ཁ་དོག་དང་ལྡན་པ། དགེ་རྒྱས་དང་། འབྲས་བུ་ཆེ་བ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པའི།
en: The Blessed One then replied, “Subhūti, it is not only the gods headed by Indra, those headed by Brahmā, and those headed by Prajāpati who will pay homage to those bodhisattva great beings who practice the perfection of wisdom, but also the gods of the Śubhakṛtsna realms, those of the Bṛhatphala realms, and those of the Pure Abodes who are of most sublime complexion will pay homage to those bodhisattva great beings who practice the perfection of wisdom accordingly.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ཕྱག་བྱ་བར་འགྱུར་རོ། །རབ་འབྱོར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གྲངས་མེད་ཚད་མེད་པ་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ལ་དགོངས་པ་མཛད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: Subhūti, all the inestimable, countless, and immeasurable tathāgatas, arhats, completely awakened buddhas who are alive at present in the world systems of the ten directions will also turn their enlightened intention toward those bodhisattva great beings who practice the perfection of wisdom.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: That is to say, they will think, ‘Those bodhisattva great beings who practice the perfection of wisdom completely perfect the perfection of generosity, and they completely perfect the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: They completely perfect the emptiness of internal phenomena, and they completely perfect [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: They completely perfect the thirty-seven factors conducive to enlightenment.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: They completely perfect the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: They completely perfect the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: They completely perfect the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ་ཞེས་བྱ་བར་དགོངས་པ་མཛད་དོ།
en: They completely perfect [the goals], up to and including all-aspect omniscience.’ “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་གང་ལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་དགོངས་པ་མཛད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སངས་རྒྱས་སུ་འགྱུར་བར་ཞུགས་པར་རིག་པར་བྱའོ།
en: Subhūti, one should know that those bodhisattva great beings who practice the perfection of wisdom, and to whom the lord buddhas direct their enlightened intention, will set out for buddhahood. “

source: །རབ་འབྱོར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན། སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བདུད་སྡིག་ཏོ་ཅན་དུ་གྱུར་ཏེ། བདུད་སྡིག་ཏོ་ཅན་དེ་དག་རེ་རེས་ཀྱང་དེ་སྙེད་ཀྱི་བདུད་སྡིག་ཏོ་ཅན་མངོན་པར་སྤྲུལ་ཀྱང་། དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་བར་ཆད་བྱ་བར་མི་ནུས་སོ།
en: Subhūti, if all the beings, as many as there are, in world systems as numerous as the grains of sand of the river Gaṅgā, were to transform into evil Māras, and if each of these Māras were also to emanate just as many evil Māras again, they would all be powerless to obstruct those bodhisattva great beings. “

source: །རབ་འབྱོར་ཆོས་གཉིས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདུད་སྡིག་ཏོ་ཅན་རྣམས་ཀྱིས་མི་ཐུབ་པ་ཡིན་ཏེ།
en: Subhūti, bodhisattva great beings who are endowed with two attributes will not be subdued by those evil Māras.

source: གཉིས་གང་ཞེ་ན། དེས་ཆོས་ཐམས་ཅད་སྟོང་པའོ་ཞེས་བྱ་བར་རྣམ་པར་བལྟས་པ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་མ་བཏང་བ་ཡིན་ཏེ།
en: If you ask what these two are, they are to regard all phenomena as emptiness and not to abandon all beings.
